backend/tests/load/load-vacancies.yml
# ============================================================
# LOAD-VACANCIES: Pruebas de carga -- Modulo de Vacantes
# Herramienta: Artillery
# Escenarios: LOAD-07, LOAD-08, LOAD-09
# ============================================================

config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Ramp-up"
    - duration: 60
      arrivalRate: 20
      name: "Carga sostenida alta"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # LOAD-07: Listado publico de vacantes bajo alto trafico
  # Endpoint publico (sin auth) -- puede recibir mucho trafico.
  # Estresa SELECT con JOIN empresa WHERE activa = true.
  - name: "LOAD-07: Listado publico de vacantes (alto trafico)"
    weight: 3
    flow:
      - get:
          url: "/api/v1/vacancies"
          expect:
            - statusCode: 200

  # LOAD-08: Busqueda con filtros bajo carga
  # Simula usuarios filtrando vacantes por modalidad.
  # Estresa queries con WHERE dinamico.
  - name: "LOAD-08: Busqueda filtrada de vacantes"
    weight: 2
    flow:
      - get:
          url: "/api/v1/vacancies?modalidad=Remoto"
          expect:
            - statusCode: 200
      - get:
          url: "/api/v1/vacancies?modalidad=Presencial"
          expect:
            - statusCode: 200
      - get:
          url: "/api/v1/vacancies?modalidad=Hibrido"
          expect:
            - statusCode: 200

  # LOAD-09: Postulaciones concurrentes a vacantes
  # Simula multiples Padawans postulandose simultaneamente.
  # Estresa la verificacion de duplicados y el INSERT.
  - name: "LOAD-09: Postulaciones concurrentes"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "loadtest@loadtest.com"
            contrasena: "LoadTestPass123!"
          capture:
            - json: "$.data.token"
              as: "token"
      - get:
          url: "/api/v1/vacancies"
          capture:
            - json: "$.data[0].vacante_id"
              as: "vacancyId"
      - post:
          url: "/api/v1/vacancies/{{ vacancyId }}/apply"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            mensaje: "Postulacion bajo carga {{ $randomNumber(1, 99999) }}"